src/Catalogs/ТранспортыОбменаДанными/ТранспортыОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортыОбменаДанными</name>
  <attributes>
    <name>ВидТранспорта</name>
    <type>
      <types>EnumRef.ВидыТранспортаСообщенийОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭлементовВТранзакцииВыгрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭлементовВТранзакцииЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СжиматьФайлИсходящегоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАрхиваСообщенияОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйДопустимыйРазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяНаРесурсе</name>
    <comment>Имя пользователя (логин) на внешнем ресурсе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяНаРесурсе</name>
    <comment>Пароль пользователя на внешнем ресурсе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапомнитьПароль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EMAILУчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИспользование</name>
    <comment>Запретить использование транспорта</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыТранспорта</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДлиннойСтрокой</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ВидыТранспортаСообщенийОбмена/ВидыТранспортаСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТранспортаСообщенийОбмена</name>
  <enumValues>
    <name>EMAIL</name>
  </enumValues>
  <enumValues>
    <name>FILE</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>COM</name>
  </enumValues>
  <enumValues>
    <name>ЯндексДиск</name>
  </enumValues>
  <enumValues>
    <name>Dropbox</name>
  </enumValues>
  <enumValues>
    <name>GoogleDrive</name>
  </enumValues>
  <enumValues>
    <name>WSПассивныйРежим</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяСистема</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ТранспортыОбменаДанными/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Возвращает значение из табличной части ПараметрыТранспорта для указанного имени
Функция ЗначениеПараметраТранспорта(ИмяПараметра) Экспорт

	СтрокаЗначения = ПараметрыТранспорта.НайтиСтроки(Новый Структура("ИмяПараметра", ИмяПараметра));
	Если СтрокаЗначения.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ?(ЗначениеЗаполнено(СтрокаЗначения[0].ЗначениеДлиннойСтрокой), СтрокаЗначения[0].ЗначениеДлиннойСтрокой, СтрокаЗначения[0].ЗначениеПараметра);
	КонецЕсли; 

КонецФункции
 
//ПроцедураВозвращает значение из табличной части ПараметрыТранспорта для указанного имени
Процедура УстановитьЗначениеПараметраТранспорта(ИмяПараметра, ЗначениеПараметра) Экспорт

	СтрокиЗначения = ПараметрыТранспорта.НайтиСтроки(Новый Структура("ИмяПараметра", ИмяПараметра));
	Если СтрокиЗначения.Количество() = 0 Тогда
		СтрокаЗначения = ПараметрыТранспорта.Добавить();
	Иначе
		СтрокаЗначения = СтрокиЗначения[0];
	КонецЕсли; 

	СтрокаЗначения.ИмяПараметра       = ИмяПараметра;
	СтрокаЗначения.ЗначениеПараметра  = ЗначениеПараметра;
	Если СтрДлина(ЗначениеПараметра) > 255 Тогда
		СтрокаЗначения.ЗначениеДлиннойСтрокой = Строка(ЗначениеПараметра);
	Иначе
		СтрокаЗначения.ЗначениеДлиннойСтрокой = "";
	КонецЕсли; 
	
КонецПроцедуры
 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ОбщегоНазначенияДеньги.ЗаполнитьОбъектПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.COM Тогда
		ЗаполнитьПараметрыТранспортаCOM();
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда
		ЗаполнитьПараметрыТранспортаFILE();
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FTP Тогда
		ЗаполнитьПараметрыТранспортаFTP();
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.WS Тогда
		ЗаполнитьПараметрыТранспортаWS();
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.ЯндексДиск Тогда
		ЗаполнитьПараметрыТранспортаЯндексДиск();
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.EMAIL Тогда
		ЗаполнитьПараметрыТранспортаEmail();
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.Dropbox Тогда
		ЗаполнитьПараметрыТранспортаDropBox();		
	КонецЕсли; 
	
	Наименование = Строка(ВидТранспорта);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Справочники.ТранспортыОбменаДанными.ОбновитьСостояниеСценария(Ссылка, ПометкаУдаления, Отказ);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПараметрыТранспортаCOM()

	ПараметрыТранспорта.Очистить();
	СтрокаПараметра("COMАутентификацияОперационнойСистемы", Ложь);
	СтрокаПараметра("COMВариантРаботыИнформационнойБазы", 1);
	СтрокаПараметра("COMИмяИнформационнойБазыНаСервере1СПредприятия", "");
	СтрокаПараметра("COMИмяСервера1СПредприятия", "");
	СтрокаПараметра("COMКаталогИнформационнойБазы", "");

КонецПроцедуры

Процедура ЗаполнитьПараметрыТранспортаFILE()

	ПараметрыТранспорта.Очистить();
	СтрокаПараметра("FILEКаталогОбменаИнформацией", "");

КонецПроцедуры

Процедура ЗаполнитьПараметрыТранспортаFTP()

	ПараметрыТранспорта.Очистить();
	СтрокаПараметра("FTPСоединениеПассивноеСоединение", Ложь);
	СтрокаПараметра("FTPСоединениеПорт", "");
	СтрокаПараметра("FTPСоединениеПуть", "");

КонецПроцедуры

Процедура ЗаполнитьПараметрыТранспортаWS()

	ПараметрыТранспорта.Очистить();
	СтрокаПараметра("WSURLВебСервиса", "");
	СтрокаПараметра("WSИспользоватьПередачуБольшогоОбъемаДанных", Истина);

КонецПроцедуры

Процедура ЗаполнитьПараметрыТранспортаЯндексДиск()

	ПараметрыТранспорта.Очистить();
	СтрокаПараметра("ЯндексДискКаталогОбменаИнформацией", "");

КонецПроцедуры

Процедура ЗаполнитьПараметрыТранспортаDropBox()

	ПараметрыТранспорта.Очистить();

КонецПроцедуры


Процедура ЗаполнитьПараметрыТранспортаEmail()

	ПараметрыТранспорта.Очистить();

КонецПроцедуры

Функция СтрокаПараметра(ИмяПараметра, ЗначениеПараметра)

	НоваяСтрока = ПараметрыТранспорта.Добавить();
	НоваяСтрока.ИмяПараметра      = ИмяПараметра;
	НоваяСтрока.ЗначениеПараметра = ЗначениеПараметра;
	
	Возврат НоваяСтрока;

КонецФункции
 

#КонецОбласти


#КонецЕсли
